README.org
#+TITLE: Ad Libitum
#+SETUPFILE: org-html-themes/setup/theme-readtheorg.setup

  The Scheme Live Coding Environment. Built on Chez Scheme and libsoundio.

  You might want to read this file here [[http://ul.mantike.pro/ad-libitum/README.html]]

* Getting Started

  This guide describes initial setup required to produce your first piece of
  digital noise with Ad Libitum. At the moment Ad Libitum is tested only on
  MacOS therefore following instructions are MacOS-specific. Any feedback and
  improvement for other platforms is more than welcome! Current state of Ad
  Libitum dependencies is that it should be easy to port it to Linux and
  moderately hard (but possible) to Windows.

** Chez Scheme

   First, you need Chez Scheme itself. Ad Libitum requires threaded version and
   you probably don't want to install x11 dependency, that's why better to do it
   from source, not brew.

*** Clone Chez Scheme repository

#+BEGIN_SRC shell
git clone https://github.com/cisco/ChezScheme.git
cd ChezScheme
#+END_SRC

*** Exclude X11 from dependencies

   Open =c/version.h= file in your favorite text editor and comment out line
   containing =libX11.dylib= reference:

#+BEGIN_SRC diff
modified   c/version.h
@@ -280,7 +280,7 @@ typedef char *memcpy_t;
 typedef int tputsputcchar;
 #define LOCKF
 #define DIRMARKERP(c) ((c) == '/')
-#define LIBX11 "/usr/X11R6/lib/libX11.dylib"
+/* #define LIBX11 "/usr/X11R6/lib/libX11.dylib" */
 #define _DARWIN_USE_64_BIT_INODE
 #define SECATIME(sb) (sb).st_atimespec.tv_sec
 #define SECCTIME(sb) (sb).st_ctimespec.tv_sec
#+END_SRC

*** Configure, build and install Chez Scheme

#+BEGIN_SRC shell
./configure --threads
make
sudo make install
#+END_SRC

*** Test it's working

    Run =scheme= from terminal and try to evaluate simple expression:

#+BEGIN_SRC shell
~/ChezScheme> scheme

Chez Scheme Version 9.4.1
Copyright 1984-2017 Cisco Systems, Inc.

> (+ 1 2 3)
6
>
#+END_SRC

** libsoundio

   This is library used by Ad Libitum for communication with your computer's
   sound system.

#+BEGIN_SRC shell
brew install libsoundio
#+END_SRC

** PortMidi

   You need it if you plan to use MIDI controller.

#+BEGIN_SRC shell
brew install portmidi
#+END_SRC

** Ad Libitum itself

*** Install

   You need to clone repository and build several helping libraries.

#+BEGIN_SRC shell
git clone https://github.com/ul/ad-libitum.git
cd ad-libitum
git submodule update --init --recursive --remote
make
#+END_SRC

*** Test

    Fire up =scheme ad-libitum.ss= and play 440Hz tuner (beware of loud sound!
    reduce speakers/headphones volume before running). Congratulations, you
    livecoded your first Ad Libitum piece!

#+BEGIN_SRC scheme
~/ad-libitum> scheme ad-libitum.ss

Chez Scheme Version 9.4.1
Copyright 1984-2017 Cisco Systems, Inc.

> (play! tuner)
>
#+END_SRC

*** Play

    Run & =geiser-connect=

#+BEGIN_SRC shell
scheme --optimize-level 2 violet.ss
#+END_SRC
* Contribution

Contribution is more than welcome and highly appreciated! Any small or non-code
fix is valuable as well, including spelling and grammar and setting proper
licensing.

* Kernel

** Sound I/O

   Ad Libitum relies on =chez-soundio= bindings and high-level wrapper. We are
   going to create and open default i/o (only 'o' at the moment) stream and
   provide it globally.

   For performance reasons =chez-sound= itself doesn't provide any protection
   against broken =write-callback=. But in livecoding mistakes are the part of
   exploration and arguably we want to sacrifice some performance to be able to
   not restart entire sound subsystem for fixing our =write-callback=. That's
   why calling =*dsp*= is wrapped into =guard=.

   To keep our scheduler clock in sync with audio we store audio time and return
   it from =now= function which is passed to scheduler later.

#+NAME: sound
#+BEGIN_SRC scheme
  ;; <sound>
  (define *time* 0.0)
  (define (now) *time*)

  (define (silence time channel) 0.0)
  (define *dsp* silence)
  (define (set-dsp! f) (set! *dsp* f))
  (define (hush!) (set-dsp! silence))

  (define (write-callback time channel)
    (set! *time* time)
    (guard (_ [else 0.0])
      (*dsp* time channel)))

  (define *sound-out* (soundio:open-default-out-stream write-callback))
  (define *sample-rate* (soundio:sample-rate *sound-out*))
  (define *channels* (soundio:channel-count *sound-out*))

  (define (start) (soundio:start-out-stream *sound-out*))
  (define (stop) (soundio:stop-out-stream *sound-out*))
  ;; </sound>
#+END_SRC

