README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Ad Libitum</title>
<!-- 2017-10-16 Mon 11:45 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ruslan Prakapchuk" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Ad Libitum</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. AD LIBITUM</a></li>
<li><a href="#sec-2">2. Getting Started</a>
<ul>
<li><a href="#sec-2-1">2.1. Chez Scheme</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. Clone Chez Scheme repository</a></li>
<li><a href="#sec-2-1-2">2.1.2. Exclude X11 from dependencies</a></li>
<li><a href="#sec-2-1-3">2.1.3. Configure, build and install Chez Scheme</a></li>
<li><a href="#sec-2-1-4">2.1.4. Test it's working</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. libsoundio</a></li>
<li><a href="#sec-2-3">2.3. PortMidi</a></li>
<li><a href="#sec-2-4">2.4. Ad Libitum itself</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1. Install</a></li>
<li><a href="#sec-2-4-2">2.4.2. Test</a></li>
<li><a href="#sec-2-4-3">2.4.3. Play</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. Contribution</a></li>
<li><a href="#sec-4">4. Kernel</a>
<ul>
<li><a href="#sec-4-1">4.1. Sound I/O</a></li>
<li><a href="#sec-4-2">4.2. Scheduler</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1. Pairing Heap</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3. Remote REPL</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1. <span class="todo TODO">TODO</span> Ensure that protocol is TCP</a></li>
<li><a href="#sec-4-3-2">4.3.2. Blocking vs Async sockets</a></li>
<li><a href="#sec-4-3-3">4.3.3. Open socket</a></li>
<li><a href="#sec-4-3-4">4.3.4. Accept connections</a></li>
<li><a href="#sec-4-3-5">4.3.5. Spawn remote REPL</a></li>
<li><a href="#sec-4-3-6">4.3.6. <span class="todo TODO">TODO</span> Stop loop and close socket on disconnect</a></li>
<li><a href="#sec-4-3-7">4.3.7. Start REPL server</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-5">5. Core</a>
<ul>
<li><a href="#sec-5-1">5.1. Math</a></li>
<li><a href="#sec-5-2">5.2. Generators</a></li>
<li><a href="#sec-5-3">5.3. Envelopes</a>
<ul>
<li><a href="#sec-5-3-1">5.3.1. ADSR</a></li>
<li><a href="#sec-5-3-2">5.3.2. Impulse</a></li>
<li><a href="#sec-5-3-3">5.3.3. Transition</a></li>
</ul>
</li>
<li><a href="#sec-5-4">5.4. Metronome</a></li>
<li><a href="#sec-5-5">5.5. Control signals</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Std</a>
<ul>
<li><a href="#sec-6-1">6.1. FFT</a></li>
<li><a href="#sec-6-2">6.2. Filters</a></li>
<li><a href="#sec-6-3">6.3. Instruments</a></li>
<li><a href="#sec-6-4">6.4. Scales</a></li>
<li><a href="#sec-6-5">6.5. Rhythm</a></li>
<li><a href="#sec-6-6">6.6. MIDI</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Misc</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> AD LIBITUM</h2>
<div class="outline-text-2" id="text-1">
<p>
The Scheme Live Coding Environment. Built on Chez Scheme and libsoundio.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Getting Started</h2>
<div class="outline-text-2" id="text-2">
<p>
This guide describes initial setup required to produce your first piece of
digital noise with Ad Libitum. At the moment Ad Libitum is tested only on
MacOS therefore following instructions are MacOS-specific. Any feedback and
improvement for other platforms is more than welcome! Current state of Ad
Libitum dependencies is that it should be easy to port it to Linux and
moderately hard (but possible) to Windows.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Chez Scheme</h3>
<div class="outline-text-3" id="text-2-1">
<p>
First, you need Chez Scheme itself. Ad Libitum requires threaded version and
you probably don't want to install x11 dependency, that's why better to do it
from source, not brew.
</p>
</div>

<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Clone Chez Scheme repository</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">

<pre class="src src-shell">git clone https://github.com/cisco/ChezScheme.git
cd ChezScheme
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Exclude X11 from dependencies</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Open <code>c/version.h</code> file in your favorite text editor and comment out line
containing <code>libX11.dylib</code> reference:
</p>

<div class="org-src-container">

<pre class="src src-diff">modified   c/version.h
@@ -280,7 +280,7 @@ typedef char *memcpy_t;
 typedef int tputsputcchar;
 #define LOCKF
 #define DIRMARKERP(c) ((c) == '/')
-#define LIBX11 "/usr/X11R6/lib/libX11.dylib"
+/* #define LIBX11 "/usr/X11R6/lib/libX11.dylib" */
 #define _DARWIN_USE_64_BIT_INODE
 #define SECATIME(sb) (sb).st_atimespec.tv_sec
 #define SECCTIME(sb) (sb).st_ctimespec.tv_sec
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> Configure, build and install Chez Scheme</h4>
<div class="outline-text-4" id="text-2-1-3">
<div class="org-src-container">

<pre class="src src-shell">./configure --threads
make
sudo make install
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> Test it's working</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
Run <code>scheme</code> from terminal and try to evaluate simple expression:
</p>

<div class="org-src-container">

<pre class="src src-shell">~/ChezScheme&gt; scheme

Chez Scheme Version 9.4.1
Copyright 1984-2017 Cisco Systems, Inc.

&gt; (+ 1 2 3)
6
&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> libsoundio</h3>
<div class="outline-text-3" id="text-2-2">
<p>
This is library used by Ad Libitum for communication with your computer's
sound system.
</p>

<div class="org-src-container">

<pre class="src src-shell">brew install libsoundio
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> PortMidi</h3>
<div class="outline-text-3" id="text-2-3">
<p>
You need it if you plan to use MIDI controller.
</p>

<div class="org-src-container">

<pre class="src src-shell">brew install portmidi
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Ad Libitum itself</h3>
<div class="outline-text-3" id="text-2-4">
</div><div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> Install</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
You need to clone repository and build several helping libraries.
</p>

<div class="org-src-container">

<pre class="src src-shell">git clone https://github.com/ul/ad-libitum.git
cd ad-libitum
git submodule update --init --recursive --remote
make
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> Test</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
Fire up <code>scheme ad-libitum.ss</code> and play 440Hz tuner (beware of loud sound!
reduce speakers/headphones volume before running). Congratulations, you
livecoded your first Ad Libitum piece!
</p>

<div class="org-src-container">

<pre class="src src-scheme">~/ad-libitum&gt; scheme ad-libitum.ss

Chez Scheme Version 9.4.1
Copyright 1984-2017 Cisco Systems, Inc.

&gt; (play! tuner)
&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4-3" class="outline-4">
<h4 id="sec-2-4-3"><span class="section-number-4">2.4.3</span> Play</h4>
<div class="outline-text-4" id="text-2-4-3">
<p>
Run &amp; <code>geiser-connect</code>
</p>

<div class="org-src-container">

<pre class="src src-shell">scheme --optimize-level 2 violet.ss
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Contribution</h2>
<div class="outline-text-2" id="text-3">
<p>
Contribution is more than welcome and highly appreciated! Any small or non-code
fix is valuable as well, including spelling and grammar and setting proper
licensing.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Kernel</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Sound I/O</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Ad Libitum relies on <code>chez-soundio</code> bindings and high-level wrapper. We are
going to create and open default i/o (only 'o' at the moment) stream and
provide it globally.
</p>

<p>
For performance reasons <code>chez-sound</code> itself doesn't provide any protection
against broken <code>write-callback</code>. But in livecoding mistakes are the part of
exploration and arguably we want to sacrifice some performance to be able to
not restart entire sound subsystem for fixing our <code>write-callback</code>. That's
why calling <code>*dsp*</code> is wrapped into <code>guard</code>.
</p>

<p>
To keep our scheduler clock in sync with audio we store audio time and return
it from <code>now</code> function which is passed to scheduler later.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="sound">;; &lt;sound&gt;
(define *time* 0.0)
(define (now) *time*)

(define (silence time channel) 0.0)
(define *dsp* silence)
(define (set-dsp! f) (set! *dsp* f))
(define (hush!) (set-dsp! silence))

(define (write-callback time channel)
  (set! *time* time)
  (guard (_ [else 0.0])
    (*dsp* time channel)))

(define *sound-out* (soundio:open-default-out-stream write-callback))
(define *sample-rate* (soundio:sample-rate *sound-out*))
(define *channels* (soundio:channel-count *sound-out*))

(define (start) (soundio:start-out-stream *sound-out*))
(define (stop) (soundio:stop-out-stream *sound-out*))
;; &lt;/sound&gt;
</pre>
</div>
</div>
</div>
