README.org
** Scheduler

  Much of music is about time. Before we produce any single sample of wave, we
  want to control when to start and when to stop doing it. Much of live coding
  is about decoupling our commands from their execution. We want to say "play
  note a second later" now, but play it a second later. It's where scheduler
  comes to play. Essentially, scheduler's API is simple and allows to get
  current time mark (whatever it means: system clock, time elapsed from
  scheduler start or number of rendered samples) and to callback procedure at
  some point of time with more or less guaranteed skew limit.

  Let's start with scheduler interface. As has been said there are two basic
  functions it must provide, =now= and =schedule=. First one allows to get
  current point in time, and it is usually comes to schedule from external
  source like audio stream to be in sync with it. Second one allows to schedule
  execution at some point in future.

#+NAME: scheduler-interface
#+BEGIN_SRC scheme
  ;; <scheduler-interface>
  <<now>>
  <<schedule>>
  ;; </scheduler-interface>
#+END_SRC

  As far as scheduler is stateful and even involves thread creation, it must
  have two other basic methods:

#+NAME: scheduler-interface
#+BEGIN_SRC scheme
  ;; <scheduler-interface>
  <<start-scheduler>>
  <<stop-scheduler>>
  ;; </scheduler-interface>
#+END_SRC

  Let's shape scheduler's data. Obviously, =now= appears here, in form of either
  scheduler's own counter or function (which will get system time or related
  write thread sample number). Another thing is =queue=, where =schedule= will
  store callbacks. Because queuing could happen from different threads at the
  same time, as well as dequeuing inside scheduler could happen together with
  queuing from another thread, we need to protect it with =mutex=. We also need
  =thread= id or flag or whatever used to control thread exit, because Scheme
  doesn't expose =pthread_kill=. And the last one which comes to the mind at the
  moment is =resolution= as a number of times per second scheduler checks the
  =queue= for expired events.

  Together with record definition we provide =simple-scheduler= which creates
  schedule with reasonable default parameters. The only thing it accepts is
  =now=, because usually you want you schedule to be in sync with external
  clock.

#+NAME: scheduler-record
#+BEGIN_SRC scheme
  ;; <scheduler-record>
  (define-record-type scheduler
    (fields now (mutable queue) resolution (mutable thread) mutex))

  (define (simple-scheduler now)
    (make-scheduler
     now           ; now
     heap/empty    ; queue
     250           ; resolution
     #f            ; thread
     (make-mutex)  ; mutex
     ))
  ;; </scheduler-record>
#+END_SRC

  Let's implement scheduler interface.

  =now= then would just call =now= field:

#+NAME: now
#+BEGIN_SRC scheme
  ;; <now>
  (define (now scheduler) ((scheduler-now scheduler)))
  ;; </now>
#+END_SRC

  Event queue accepts events which must have =f= with its
  =args= to execute at =time=:

#+NAME: event-record
#+BEGIN_SRC scheme
  ;; <event-record>
  (define-record-type event
    (fields time f args))
  ;; </event-record>
#+END_SRC

  For =queue= we need some heap implementation, I'm going to jump into [[Pairing
  Heap]]!

  Mutex is used to prevent data race on insert and remove from queue happening
  in different threads.

  =schedule= should accept either =event= record, or its fields (and create
  record by itself) to unclutter user code.

#+NAME: schedule
#+BEGIN_SRC scheme
  ;; <schedule>
  (define schedule
    (case-lambda
      [(scheduler event)
       (with-mutex (scheduler-mutex scheduler)
                   (scheduler-queue-set! scheduler (heap/insert event-time event (scheduler-queue scheduler))))]
      [(scheduler t f . args)
       (schedule scheduler (make-event (inexact t) f args))]))
  ;; </schedule>
#+END_SRC

  Processing events is just executing any expired events' functions and removing
  them from the queue.

  To enable dynamic temporal recursion we support event's =f= to be a symbol
  referring top level function.

  Of course, live events are error prone, but we don't want flawed event to blow
  entire thread. Thus =f= execution is secured with =guard=.

#+NAME: scheduler-process-events
#+BEGIN_SRC scheme
  ;; <scheduler-process-events>
  (define (process-events scheduler time)
    (with-mutex
     (scheduler-mutex scheduler)
     (let next-event ()
       (let ([event (heap/find-min (scheduler-queue scheduler))])
         (when (and event (<= (event-time event) time))
           (scheduler-queue-set!
            scheduler
            (heap/delete-min event-time (scheduler-queue scheduler)))
           (guard (_ [else #f])
             (let ([f (event-f event)])
               (apply (if (symbol? f)
                          (top-level-value f)
                          f)
                      (event-args event))))
           (next-event))))))
  ;; </scheduler-process-events>
#+END_SRC

  Now it's a time for start/stop thread. Stopping thread would be just setting a
  flag which I used to call "poison pill".

#+NAME: stop-scheduler
#+BEGIN_SRC scheme
  ;; <stop-scheduler>
  (define (stop-scheduler scheduler)
    (scheduler-thread-set! scheduler #f))
  ;; </stop-scheduler>
#+END_SRC

  Starting thread will fork and loop calling expired events. We set expire
  period for a half of resolution period in future to compensate a little bit
  that events could expire during =process-events=. Proper adjustment require
  further investigation taking in account that audio clock is not uniform (it
  moves fast inside filling audio buffer process then waits to buffer to be
  available again).

#+NAME: start-scheduler
#+BEGIN_SRC scheme
  ;; <start-scheduler>
  (define (start-scheduler scheduler)
    (fork-thread
     (lambda ()
       (scheduler-thread-set! scheduler (get-thread-id))
       (let* ([resolution (scheduler-resolution scheduler)]
              [expired-horizon (/ 0.5 resolution)]
              [microseconds-to-sleep (exact (floor (/ 1e6 resolution)))])
         (let loop ()
           (when (scheduler-thread scheduler)
             (process-events scheduler (+ (now scheduler) expired-horizon))
             (usleep 0 microseconds-to-sleep)
             (loop)))))))
  ;; </start-scheduler>
#+END_SRC

#+NAME: scheduler
#+BEGIN_SRC scheme
  ;; <scheduler>
  <<scheduler-record>>
  <<event-record>>
  <<scheduler-process-events>>
  <<scheduler-interface>>
  ;; </scheduler>
#+END_SRC

  We need just a simple default scheduler at hand for Ad Libitum needs:

#+NAME: easy-scheduler
#+BEGIN_SRC scheme
  (define *scheduler* #f)
  (define (init now) (set! *scheduler* (simple-scheduler now)))
  (define (start) (start-scheduler *scheduler*))
  (define (stop) (stop-scheduler *scheduler*))
  (define (*schedule* t f . args) (schedule *scheduler* (make-event t f args)))
  (define (*now*) (now *scheduler*))
#+END_SRC

