README.html

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Scheduler</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Much of music is about time. Before we produce any single sample of wave, we
want to control when to start and when to stop doing it. Much of live coding
is about decoupling our commands from their execution. We want to say "play
note a second later" now, but play it a second later. It's where scheduler
comes to play. Essentially, scheduler's API is simple and allows to get
current time mark (whatever it means: system clock, time elapsed from
scheduler start or number of rendered samples) and to callback procedure at
some point of time with more or less guaranteed skew limit.
</p>

<p>
Let's start with scheduler interface. As has been said there are two basic
functions it must provide, <code>now</code> and <code>schedule</code>. First one allows to get
current point in time, and it is usually comes to schedule from external
source like audio stream to be in sync with it. Second one allows to schedule
execution at some point in future.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="scheduler-interface">;; &lt;scheduler-interface&gt;
&lt;&lt;now&gt;&gt;
&lt;&lt;schedule&gt;&gt;
;; &lt;/scheduler-interface&gt;
</pre>
</div>

<p>
As far as scheduler is stateful and even involves thread creation, it must
have two other basic methods:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="scheduler-interface">;; &lt;scheduler-interface&gt;
&lt;&lt;start-scheduler&gt;&gt;
&lt;&lt;stop-scheduler&gt;&gt;
;; &lt;/scheduler-interface&gt;
</pre>
</div>

<p>
Let's shape scheduler's data. Obviously, <code>now</code> appears here, in form of either
scheduler's own counter or function (which will get system time or related
write thread sample number). Another thing is <code>queue</code>, where <code>schedule</code> will
store callbacks. Because queuing could happen from different threads at the
same time, as well as dequeuing inside scheduler could happen together with
queuing from another thread, we need to protect it with <code>mutex</code>. We also need
<code>thread</code> id or flag or whatever used to control thread exit, because Scheme
doesn't expose <code>pthread_kill</code>. And the last one which comes to the mind at the
moment is <code>resolution</code> as a number of times per second scheduler checks the
<code>queue</code> for expired events.
</p>

<p>
Together with record definition we provide <code>simple-scheduler</code> which creates
schedule with reasonable default parameters. The only thing it accepts is
<code>now</code>, because usually you want you schedule to be in sync with external
clock.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="scheduler-record">;; &lt;scheduler-record&gt;
(define-record-type scheduler
  (fields now (mutable queue) resolution (mutable thread) mutex))

(define (simple-scheduler now)
  (make-scheduler
   now           ; now
   heap/empty    ; queue
   250           ; resolution
   #f            ; thread
   (make-mutex)  ; mutex
   ))
;; &lt;/scheduler-record&gt;
</pre>
</div>

<p>
Let's implement scheduler interface.
</p>

<p>
<code>now</code> then would just call <code>now</code> field:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="now">;; &lt;now&gt;
(define (now scheduler) ((scheduler-now scheduler)))
;; &lt;/now&gt;
</pre>
</div>

<p>
Event queue accepts events which must have <code>f</code> with its
<code>args</code> to execute at <code>time</code>:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="event-record">;; &lt;event-record&gt;
(define-record-type event
  (fields time f args))
;; &lt;/event-record&gt;
</pre>
</div>

<p>
For <code>queue</code> we need some heap implementation, I'm going to jump into <a href="#sec-4-2-1">4.2.1</a>!
</p>

<p>
Mutex is used to prevent data race on insert and remove from queue happening
in different threads.
</p>

<p>
<code>schedule</code> should accept either <code>event</code> record, or its fields (and create
record by itself) to unclutter user code.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="schedule">;; &lt;schedule&gt;
(define schedule
  (case-lambda
    [(scheduler event)
     (with-mutex (scheduler-mutex scheduler)
		 (scheduler-queue-set! scheduler (heap/insert event-time event (scheduler-queue scheduler))))]
    [(scheduler t f . args)
     (schedule scheduler (make-event (inexact t) f args))]))
;; &lt;/schedule&gt;
</pre>
</div>

<p>
Processing events is just executing any expired events' functions and removing
them from the queue.
</p>

<p>
To enable dynamic temporal recursion we support event's <code>f</code> to be a symbol
referring top level function.
</p>

<p>
Of course, live events are error prone, but we don't want flawed event to blow
entire thread. Thus <code>f</code> execution is secured with <code>guard</code>.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="scheduler-process-events">;; &lt;scheduler-process-events&gt;
(define (process-events scheduler time)
  (with-mutex
   (scheduler-mutex scheduler)
   (let next-event ()
     (let ([event (heap/find-min (scheduler-queue scheduler))])
       (when (and event (&lt;= (event-time event) time))
	 (scheduler-queue-set!
	  scheduler
	  (heap/delete-min event-time (scheduler-queue scheduler)))
	 (guard (_ [else #f])
	   (let ([f (event-f event)])
	     (apply (if (symbol? f)
			(top-level-value f)
			f)
		    (event-args event))))
	 (next-event))))))
;; &lt;/scheduler-process-events&gt;
</pre>
</div>

<p>
Now it's a time for start/stop thread. Stopping thread would be just setting a
flag which I used to call "poison pill".
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="stop-scheduler">;; &lt;stop-scheduler&gt;
(define (stop-scheduler scheduler)
  (scheduler-thread-set! scheduler #f))
;; &lt;/stop-scheduler&gt;
</pre>
</div>

<p>
Starting thread will fork and loop calling expired events. We set expire
period for a half of resolution period in future to compensate a little bit
that events could expire during <code>process-events</code>. Proper adjustment require
further investigation taking in account that audio clock is not uniform (it
moves fast inside filling audio buffer process then waits to buffer to be
available again).
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="start-scheduler">;; &lt;start-scheduler&gt;
(define (start-scheduler scheduler)
  (fork-thread
   (lambda ()
     (scheduler-thread-set! scheduler (get-thread-id))
     (let* ([resolution (scheduler-resolution scheduler)]
	    [expired-horizon (/ 0.5 resolution)]
	    [microseconds-to-sleep (exact (floor (/ 1e6 resolution)))])
       (let loop ()
	 (when (scheduler-thread scheduler)
	   (process-events scheduler (+ (now scheduler) expired-horizon))
	   (usleep 0 microseconds-to-sleep)
	   (loop)))))))
;; &lt;/start-scheduler&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="scheduler">;; &lt;scheduler&gt;
&lt;&lt;scheduler-record&gt;&gt;
&lt;&lt;event-record&gt;&gt;
&lt;&lt;scheduler-process-events&gt;&gt;
&lt;&lt;scheduler-interface&gt;&gt;
;; &lt;/scheduler&gt;
</pre>
</div>

<p>
We need just a simple default scheduler at hand for Ad Libitum needs:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="easy-scheduler">(define *scheduler* #f)
(define (init now) (set! *scheduler* (simple-scheduler now)))
(define (start) (start-scheduler *scheduler*))
(define (stop) (stop-scheduler *scheduler*))
(define (*schedule* t f . args) (schedule *scheduler* (make-event t f args)))
(define (*now*) (now *scheduler*))
</pre>
</div>
</div>
