README.org
*** Pairing Heap

   Wikipedia's type definition for pairing heap structure looks like Scheme's
   pairs (surprise =) ). Using them implementation is quite straightforward.

#+NAME: pairing-heap
#+BEGIN_SRC scheme
  ;; <pairing-heap>
  ;; we do some #f-punning and don't throw on empty heaps

  (define heap/empty '())

  (define (heap/find-min heap)
    (if (null? heap)
        #f
        (car heap)))

  (define (heap/merge comparator h1 h2)
    (cond
     [(null? h1) h2]
     [(null? h2) h1]
     [(< (comparator (car h1)) (comparator (car h2)))
      (cons (car h1) (cons h2 (cdr h1)))]
     [else
      (cons (car h2) (cons h1 (cdr h2)))]))

  (define (heap/insert comparator elem heap)
    (heap/merge comparator (cons elem '()) heap))

  (define (heap/merge-pairs comparator subheaps)
    (cond
     [(null? subheaps) heap/empty]
     [(null? (cdr subheaps)) (car subheaps)]
     [else (heap/merge comparator
            (heap/merge comparator (car subheaps) (cadr subheaps))
            (heap/merge-pairs comparator (cddr subheaps)))]))

  (define (heap/delete-min comparator heap)
    (if (null? heap)
        heap/empty
        (heap/merge-pairs comparator (cdr heap))))
  ;; </pairing-heap>
#+END_SRC

** Remote REPL

   We need own repl server because music doesn't work in geiser repl for
   somewhat reason. The most universal solution would be to have REPL over
   either UDP or TCP with the simplest possible protocol. We want it to be just
   a carrier, everything else should happen inside editor and engine. Sadly Chez
   Scheme has no sockets in its std lib. We are gonna try Aaron W. Hsu's
   [[https://github.com/arcfide/chez-sockets][chez-sockets]] library.

   Actually, we are still able to use Geiser with our REPL server because it
   supports remote REPL. See "Connecting to an external Scheme" at [[http://www.nongnu.org/geiser/geiser_3.html#The-REPL][docs]]. The
   only thing required for it is to load =scheme/chez/geiser/geiser.ss= into the
   REPL thread.

   First, let's create a TCP socket. Here we rely on assumption, that default
   protocol is TCP.

*** TODO Ensure that protocol is TCP

*** Blocking vs Async sockets

    Though Aaron doesn't recommend using blocking sockets, they are so much
    easier for our case! No need to implement polling when waiting for
    connection or receiving value.

    Tried blocking sockets. They work fine by themselves, but play bad with
    =sleep= called from other threads! Falling back to async sockets and polling
    then.

*** Open socket

#+NAME: open-socket
#+BEGIN_SRC scheme
  ;; <open-socket>
  (define (open-socket)
    (let ([socket (sock:create-socket
                   sock:socket-domain/internet
                   sock:socket-type/stream
                   sock:socket-protocol/auto)])
      <<bind-socket>>
      <<listen-socket>>
      socket
      ))
  ;; </open-socket>
#+END_SRC

    Then we are going to listen address and port for input. We'll make it
    configurable later, let's provide some sensible hardcoded defaults for now.
    /localhost/ is for security reasons, and /37146/ is default Geiser port.

#+NAME: bind-socket
#+BEGIN_SRC scheme
  ;; <bind-socket>
  (sock:bind-socket socket (sock:string->internet-address "127.0.0.1:37146"))
  ;; </bind-socket>
#+END_SRC

    And then let's listen for new connections!

#+NAME: listen-socket
#+BEGIN_SRC scheme
  ;; <listen-socket>
  (sock:listen-socket socket 1024)
  ;; </listen-socket>
#+END_SRC

*** Accept connections

    To actually accept new connections we are going to create new thread and
    just run infinite loop with =accept-socket= inside. Remember, our socket is
    non-blocking so we are to make polling to not eat all CPU by eager calls.
    After accepting new connection we'll proceed it in new thread.

#+NAME: accept-connections
#+BEGIN_SRC scheme
  ;; <accept-connections>
  (define (accept-connections repl-server-socket)
    (fork-thread
     (lambda ()
       (let loop ()
         (usleep 0 polling-microseconds)
         (let-values ([(socket address) (sock:accept-socket repl-server-socket)])
           (when socket
             (printf "New REPL @ ~s\r\n" (sock:internet-address->string address))
             (spawn-remote-repl socket address)))
         (loop)))))
  ;; </accept-connections>
#+END_SRC

