README.html

<div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Pairing Heap</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Wikipedia's type definition for pairing heap structure looks like Scheme's
pairs (surprise =) ). Using them implementation is quite straightforward.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="pairing-heap">;; &lt;pairing-heap&gt;
;; we do some #f-punning and don't throw on empty heaps

(define heap/empty '())

(define (heap/find-min heap)
  (if (null? heap)
      #f
      (car heap)))

(define (heap/merge comparator h1 h2)
  (cond
   [(null? h1) h2]
   [(null? h2) h1]
   [(&lt; (comparator (car h1)) (comparator (car h2)))
    (cons (car h1) (cons h2 (cdr h1)))]
   [else
    (cons (car h2) (cons h1 (cdr h2)))]))

(define (heap/insert comparator elem heap)
  (heap/merge comparator (cons elem '()) heap))

(define (heap/merge-pairs comparator subheaps)
  (cond
   [(null? subheaps) heap/empty]
   [(null? (cdr subheaps)) (car subheaps)]
   [else (heap/merge comparator
	  (heap/merge comparator (car subheaps) (cadr subheaps))
	  (heap/merge-pairs comparator (cddr subheaps)))]))

(define (heap/delete-min comparator heap)
  (if (null? heap)
      heap/empty
      (heap/merge-pairs comparator (cdr heap))))
;; &lt;/pairing-heap&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Remote REPL</h3>
<div class="outline-text-3" id="text-4-3">
<p>
We need own repl server because music doesn't work in geiser repl for
somewhat reason. The most universal solution would be to have REPL over
either UDP or TCP with the simplest possible protocol. We want it to be just
a carrier, everything else should happen inside editor and engine. Sadly Chez
Scheme has no sockets in its std lib. We are gonna try Aaron W. Hsu's
<a href="https://github.com/arcfide/chez-sockets">chez-sockets</a> library.
</p>

<p>
Actually, we are still able to use Geiser with our REPL server because it
supports remote REPL. See "Connecting to an external Scheme" at <a href="http://www.nongnu.org/geiser/geiser_3.html#The-REPL">docs</a>. The
only thing required for it is to load <code>scheme/chez/geiser/geiser.ss</code> into the
REPL thread.
</p>

<p>
First, let's create a TCP socket. Here we rely on assumption, that default
protocol is TCP.
</p>
</div>

<div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> <span class="todo TODO">TODO</span> Ensure that protocol is TCP</h4>
</div>

<div id="outline-container-sec-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> Blocking vs Async sockets</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
Though Aaron doesn't recommend using blocking sockets, they are so much
easier for our case! No need to implement polling when waiting for
connection or receiving value.
</p>

<p>
Tried blocking sockets. They work fine by themselves, but play bad with
<code>sleep</code> called from other threads! Falling back to async sockets and polling
then.
</p>
</div>
</div>

<div id="outline-container-sec-4-3-3" class="outline-4">
<h4 id="sec-4-3-3"><span class="section-number-4">4.3.3</span> Open socket</h4>
<div class="outline-text-4" id="text-4-3-3">
<div class="org-src-container">

<pre class="src src-scheme" id="open-socket">;; &lt;open-socket&gt;
(define (open-socket)
  (let ([socket (sock:create-socket
		 sock:socket-domain/internet
		 sock:socket-type/stream
		 sock:socket-protocol/auto)])
    &lt;&lt;bind-socket&gt;&gt;
    &lt;&lt;listen-socket&gt;&gt;
    socket
    ))
;; &lt;/open-socket&gt;
</pre>
</div>

<p>
Then we are going to listen address and port for input. We'll make it
configurable later, let's provide some sensible hardcoded defaults for now.
<i>localhost</i> is for security reasons, and <i>37146</i> is default Geiser port.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="bind-socket">;; &lt;bind-socket&gt;
(sock:bind-socket socket (sock:string-&gt;internet-address "127.0.0.1:37146"))
;; &lt;/bind-socket&gt;
</pre>
</div>

<p>
And then let's listen for new connections!
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="listen-socket">;; &lt;listen-socket&gt;
(sock:listen-socket socket 1024)
;; &lt;/listen-socket&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-3-4" class="outline-4">
<h4 id="sec-4-3-4"><span class="section-number-4">4.3.4</span> Accept connections</h4>
<div class="outline-text-4" id="text-4-3-4">
<p>
To actually accept new connections we are going to create new thread and
just run infinite loop with <code>accept-socket</code> inside. Remember, our socket is
non-blocking so we are to make polling to not eat all CPU by eager calls.
After accepting new connection we'll proceed it in new thread.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="accept-connections">;; &lt;accept-connections&gt;
(define (accept-connections repl-server-socket)
  (fork-thread
   (lambda ()
     (let loop ()
       (usleep 0 polling-microseconds)
       (let-values ([(socket address) (sock:accept-socket repl-server-socket)])
	 (when socket
	   (printf "New REPL @ ~s\r\n" (sock:internet-address-&gt;string address))
	   (spawn-remote-repl socket address)))
       (loop)))))
;; &lt;/accept-connections&gt;
</pre>
</div>
</div>
</div>
