README.org
*** Spawn remote REPL

    Every new connection accepted would spawn new thread with a REPL loop inside
    it. Because we are using async sockets, we are forced to run actual loop and
    poll socket for values. /50ms/ should be a reasonable polling delay to keep
    it responsive and not resource greedy at the same time. Also
    =receive-from-socket= require to limit maximum message length. Here /65k/ is
    also is a kind of a guess. Chez Scheme operates UTF-8 strings and messages
    are read as bytevectors from sockets, thus we need a transcoder to convert
    them back and forth. Let's put all these requirements to values:

#+NAME: spawn-remote-repl-options
#+BEGIN_SRC scheme
  ;; <spawn-remote-repl-options>
  (define polling-microseconds 50000)
  (define max-chunk-length 65536)
  (define code-tx (make-transcoder (utf-8-codec) (eol-style lf) (error-handling-mode replace)))
  ;; </spawn-remote-repl-options>
#+END_SRC

    Preparations are straightforward: define some helpers, send initial prompt,
    and start loop.

#+NAME: spawn-remote-repl
#+BEGIN_SRC scheme
  ;; <spawn-remote-repl>
  <<spawn-remote-repl-options>>
  (define (spawn-remote-repl socket address)
    (fork-thread
     (lambda ()
       (let* (
              <<repl-send-helpers>>
              )
         (send-prompt)
         <<repl-loop>>
         ))))
  ;; </spawn-remote-repl>
#+END_SRC

    Converting messages to bytevectors and sending to proper port is quite
    tedious, let's write a couple of helpers:

#+NAME: repl-send-helpers
#+BEGIN_SRC scheme
  ;; <repl-send-helpers>
  [call-with-send-port
   (lambda (f)
     (let ([response (call-with-bytevector-output-port f code-tx)])
       (sock:send-to-socket socket response address)))]
  [send-prompt
   (lambda ()
     (call-with-send-port (lambda (p) (display "> " p))))]
  ;; </repl-send-helpers>
#+END_SRC

    Loop starts with polling delay. For simplicity it's constant and
    unconditional in the beginning of every cycle. If socket is ready and
    contains non-empty message then we do evaluation and send result back.
    Reading from socket is implemented via ports, look at =chez-socket=
    documentation for more info.

#+NAME: repl-loop
#+BEGIN_SRC scheme
  ;; <repl-loop>
  (let loop ()
    (usleep 0 polling-microseconds)
    (let-values ([(request address)
                  (sock:receive-from-socket socket max-chunk-length)])
      (if (and request (positive? (bytevector-length request)))
          (call-with-port
           (open-bytevector-input-port request code-tx)
           <<repl-read-eval-print>>
           )
          (loop))))
  ;; </repl-loop>
#+END_SRC

    Our remote REPL supports multi-form messages, therefore we need inner loop to
    read and process them one by one.

#+NAME: repl-read-eval-print
#+BEGIN_SRC scheme
  ;; <repl-read-eval-print>
  (lambda (p)
    (do ([x (read p) (read p)])
        ((eof-object? x))
      (printf "> ~s\r\n" x)
      (call-with-send-port
       <<repl-eval-print>>
       ))
    (send-prompt)
    (loop))
  ;; </repl-read-eval-print>
#+END_SRC

    Eval and send result back, easy, huh?

#+NAME: repl-eval-print
#+BEGIN_SRC scheme
  ;; <repl-eval-print>
  (lambda (p)
    (let* (
           <<repl-eval>>
           )
      <<repl-print>>
      )
    )
  ;; </repl-eval-print>
#+END_SRC

    Tricky part is that we want to:

      - capture output performed by evaluated form
      - capture result of form evaluated
      - don't blow up on exception and capture its message

    That's why we can't just call =eval=

#+NAME: repl-eval
#+BEGIN_SRC scheme
  ;; <repl-eval>
  [result #f]
  [output
   (with-output-to-string
     (lambda ()
       (set! result (guard (x [else (display-condition x)]) (eval x)))))]
  ;; </repl-eval>
#+END_SRC

    On the other hand, sending is quite straightforward, because we need just to
    write to port provided by =call-with-send-port=

#+NAME: repl-print
#+BEGIN_SRC scheme
  ;; <repl-print>
  (printf "| ~s\r\n" output)
  (printf "< ~s\r\n" result)
  (display output p)
  (display result p)
  (newline p)
  ;; </repl-print>
#+END_SRC

*** TODO Stop loop and close socket on disconnect

*** Start REPL server

#+NAME: start-repl-server
#+BEGIN_SRC scheme
  ;; <start-repl-server>
  (define (start-repl-server)
    (accept-connections (open-socket)))
  ;; </start-repl-server>
#+END_SRC

* Core

  Woohoo! Naive [[Kernel]] draft is here and we could start to explore Core basics
  of Sound. At this point Ad Libitum splits into into interwinded parts: the
  framework and the book. In the framework we are going to grow all necessary
  instruments for live coding. In the book we are going to use those instruments
  to experiment with sound.

  One of the naming principles of Ad Libitum variables and functions is that
  they should have proper long self-describing name for clarity and could have
  any funky alias for shortening during performance and for fun cryptic
  librettos.

** Math

   Before diving into the abyss of digital music let's define several useful
   basic math constants and functions.

#+NAME: basic-math
#+BEGIN_SRC scheme
  ;; <basic-math>
  (define pi (inexact (* (asin 1.0) 2)))
  (define two-pi (* 2.0 pi))
  (alias π pi)
  (alias 2π two-pi)

  (define (random-amplitude)
    (- (random 2.0) 1.0))
  ;; </basic-math>
#+END_SRC

