README.html

<div id="outline-container-sec-4-3-5" class="outline-4">
<h4 id="sec-4-3-5"><span class="section-number-4">4.3.5</span> Spawn remote REPL</h4>
<div class="outline-text-4" id="text-4-3-5">
<p>
Every new connection accepted would spawn new thread with a REPL loop inside
it. Because we are using async sockets, we are forced to run actual loop and
poll socket for values. <i>50ms</i> should be a reasonable polling delay to keep
it responsive and not resource greedy at the same time. Also
<code>receive-from-socket</code> require to limit maximum message length. Here <i>65k</i> is
also is a kind of a guess. Chez Scheme operates UTF-8 strings and messages
are read as bytevectors from sockets, thus we need a transcoder to convert
them back and forth. Let's put all these requirements to values:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="spawn-remote-repl-options">;; &lt;spawn-remote-repl-options&gt;
(define polling-microseconds 50000)
(define max-chunk-length 65536)
(define code-tx (make-transcoder (utf-8-codec) (eol-style lf) (error-handling-mode replace)))
;; &lt;/spawn-remote-repl-options&gt;
</pre>
</div>

<p>
Preparations are straightforward: define some helpers, send initial prompt,
and start loop.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="spawn-remote-repl">;; &lt;spawn-remote-repl&gt;
&lt;&lt;spawn-remote-repl-options&gt;&gt;
(define (spawn-remote-repl socket address)
  (fork-thread
   (lambda ()
     (let* (
	    &lt;&lt;repl-send-helpers&gt;&gt;
	    )
       (send-prompt)
       &lt;&lt;repl-loop&gt;&gt;
       ))))
;; &lt;/spawn-remote-repl&gt;
</pre>
</div>

<p>
Converting messages to bytevectors and sending to proper port is quite
tedious, let's write a couple of helpers:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="repl-send-helpers">;; &lt;repl-send-helpers&gt;
[call-with-send-port
 (lambda (f)
   (let ([response (call-with-bytevector-output-port f code-tx)])
     (sock:send-to-socket socket response address)))]
[send-prompt
 (lambda ()
   (call-with-send-port (lambda (p) (display "&gt; " p))))]
;; &lt;/repl-send-helpers&gt;
</pre>
</div>

<p>
Loop starts with polling delay. For simplicity it's constant and
unconditional in the beginning of every cycle. If socket is ready and
contains non-empty message then we do evaluation and send result back.
Reading from socket is implemented via ports, look at <code>chez-socket</code>
documentation for more info.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="repl-loop">;; &lt;repl-loop&gt;
(let loop ()
  (usleep 0 polling-microseconds)
  (let-values ([(request address)
		(sock:receive-from-socket socket max-chunk-length)])
    (if (and request (positive? (bytevector-length request)))
	(call-with-port
	 (open-bytevector-input-port request code-tx)
	 &lt;&lt;repl-read-eval-print&gt;&gt;
	 )
	(loop))))
;; &lt;/repl-loop&gt;
</pre>
</div>

<p>
Our remote REPL supports multi-form messages, therefore we need inner loop to
read and process them one by one.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="repl-read-eval-print">;; &lt;repl-read-eval-print&gt;
(lambda (p)
  (do ([x (read p) (read p)])
      ((eof-object? x))
    (printf "&gt; ~s\r\n" x)
    (call-with-send-port
     &lt;&lt;repl-eval-print&gt;&gt;
     ))
  (send-prompt)
  (loop))
;; &lt;/repl-read-eval-print&gt;
</pre>
</div>

<p>
Eval and send result back, easy, huh?
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="repl-eval-print">;; &lt;repl-eval-print&gt;
(lambda (p)
  (let* (
	 &lt;&lt;repl-eval&gt;&gt;
	 )
    &lt;&lt;repl-print&gt;&gt;
    )
  )
;; &lt;/repl-eval-print&gt;
</pre>
</div>

<p>
Tricky part is that we want to:
</p>

<ul class="org-ul">
<li>capture output performed by evaluated form
</li>
<li>capture result of form evaluated
</li>
<li>don't blow up on exception and capture its message
</li>
</ul>

<p>
That's why we can't just call <code>eval</code>
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="repl-eval">;; &lt;repl-eval&gt;
[result #f]
[output
 (with-output-to-string
   (lambda ()
     (set! result (guard (x [else (display-condition x)]) (eval x)))))]
;; &lt;/repl-eval&gt;
</pre>
</div>

<p>
On the other hand, sending is quite straightforward, because we need just to
write to port provided by <code>call-with-send-port</code>
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="repl-print">;; &lt;repl-print&gt;
(printf "| ~s\r\n" output)
(printf "&lt; ~s\r\n" result)
(display output p)
(display result p)
(newline p)
;; &lt;/repl-print&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-3-6" class="outline-4">
<h4 id="sec-4-3-6"><span class="section-number-4">4.3.6</span> <span class="todo TODO">TODO</span> Stop loop and close socket on disconnect</h4>
</div>

<div id="outline-container-sec-4-3-7" class="outline-4">
<h4 id="sec-4-3-7"><span class="section-number-4">4.3.7</span> Start REPL server</h4>
<div class="outline-text-4" id="text-4-3-7">
<div class="org-src-container">

<pre class="src src-scheme" id="start-repl-server">;; &lt;start-repl-server&gt;
(define (start-repl-server)
  (accept-connections (open-socket)))
;; &lt;/start-repl-server&gt;
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Core</h2>
<div class="outline-text-2" id="text-5">
<p>
Woohoo! Naive <a href="#sec-4">4</a> draft is here and we could start to explore Core basics
of Sound. At this point Ad Libitum splits into into interwinded parts: the
framework and the book. In the framework we are going to grow all necessary
instruments for live coding. In the book we are going to use those instruments
to experiment with sound.
</p>

<p>
One of the naming principles of Ad Libitum variables and functions is that
they should have proper long self-describing name for clarity and could have
any funky alias for shortening during performance and for fun cryptic
librettos.
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Math</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Before diving into the abyss of digital music let's define several useful
basic math constants and functions.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="basic-math">;; &lt;basic-math&gt;
(define pi (inexact (* (asin 1.0) 2)))
(define two-pi (* 2.0 pi))
(alias π pi)
(alias 2π two-pi)

(define (random-amplitude)
  (- (random 2.0) 1.0))
;; &lt;/basic-math&gt;
</pre>
</div>
</div>
</div>
