README.html

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Generators</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Sound is about motion. About our mean of sensing somewhat periodic motion
a.k.a waves. The higher is period, the higher is signal pitch. Waveform
determines character of signal. And irregularities determine&#x2026; Something.
Noise? Personality? We'll try to discover.
</p>

<p>
Though signal demonstration usually started with sine waveform as the most
recognizable and surprisingly pleasant one, we are going to start with
computationally simplest one (though potentially not the fastest to calculate).
</p>

<p>
Technically, the simplest generator is just a constant value, no motion,
silence. But which stands next in simplicity?
</p>

<p>
It's the signal, which is in one position half of a time and in another position
in another half. By "time" here I mean one cycle, one period of signal.
</p>

<p>
But first let define a couple of constants to start with. It's a frequency we
want to hear and its derivatives.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="tuner-constants">;; &lt;tuner-constants&gt;
(define tuner-frequency 440.0)
(define tuner-period (/ tuner-frequency))
(define tuner-half-period (* 0.5 tuner-period))
;; &lt;/tuner-constants&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="simplest-oscillator">;; &lt;simplest-oscillator&gt;
(define (simplest-oscillator time channel)
  (if (&gt; (mod time tuner-period) tuner-half-period)
      1.0
      -1.0))
;; &lt;/simplest-oscillator&gt;
</pre>
</div>

<p>
Actually, this waveform is called square, because of shape. Once we'll add
visualisation library to Ad Libitum, before that try to draw function plot by hands.
</p>

<p>
Feel free to experiment with different waveforms, we will do it together
later. Let's step back and look at our example and try to come up with useful
abstraction. Our DSP callback has signature <code>f(time, channel) -&gt; amplitude</code>,
which is the basis for any audio signal. But what prevents us using audio
signals as the main medium for building sound? Nothing! It's even very handy.
Audio signals then are capable of control parameters of other signal,
naturally forming audio graph. And Chez Scheme should optimize that CSP-like
style well. But we need to think carefully ahead of time about signature
itself. What if later we want add additional information flowing every
sample? What if returning just float is not enough to express all we want?
Because it's very beautiful, that every signal could be either interpreted as
a DSP callback alone, and could be passed to other signals. But in the latter
case sometimes it's not enough to communicate between signals with a single
float. Perhaps something like <code>f(time, channel, data) -&gt; (amplitude, data)</code>
could do the job? Where structure of <code>data</code> is determined by your
application, and parent signal is responsible for using or discarding the
<code>data</code> returned by child signal. OTOH, <code>data</code> in parameters plays like a
container for some global state to survive between samples, and we could
replace it with actual global or closured state in our application. The same
thing for returned data.
</p>

<p>
Let's start with <code>f(time, channel) -&gt; amplitude</code> then and pray that we didn't
overlook something important.
</p>

<p>
To ease writing signal creators and spotting them in code let's introduce
small helper:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="signal">;; &lt;signal&gt;
(define-syntax (signal stx)
  (syntax-case stx ()
    [(k body ...)
     (with-syntax ([time (datum-&gt;syntax #'k 'time)]
		   [channel (datum-&gt;syntax #'k 'channel)])
       #'(λ (time channel) body ...))]))

(alias ~&lt; signal)

(define-syntax (define-signal stx)
  (syntax-case stx ()
    [(k args body ...)
     (with-syntax ([time (datum-&gt;syntax #'k 'time)]
		   [channel (datum-&gt;syntax #'k 'channel)])
       #'(define args
	   (λ (time channel)
	     body ...)))]))

(alias define~ define-signal)
;; &lt;/signal&gt;
</pre>
</div>

<p>
The most basic signal is just a constant one, which is essentially created by
our shiny new syntax <code>(~&lt; amplitude)</code>. But <code>~&lt;</code> is a macro and having
function is useful for composition matters:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="constant">;; &lt;constant&gt;
(define~ (constant amplitude) amplitude)
;; &lt;/constant&gt;
</pre>
</div>

<p>
Then we are able to define <code>silence</code> as follows:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="silence">;; &lt;silence&gt;
(define~ silence 0.0)
(alias ∅ silence)
;; &lt;/silence&gt;
</pre>
</div>

<p>
Quick question for self-test: what sound would <code>(~&lt; 1.0)</code> produce?
</p>

<p>
Though it's still very useful signal, let give it a separate name:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="unit">(define~ unit 1.0)
</pre>
</div>

<p>
For composing signal creators we could define a helper, which is the regular
function composition!
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="compose">;; &lt;compose&gt;
(define (compose . fns)
  (define (make-chain fn chain)
    (λ args (call-with-values (cut apply fn args) chain)))
  (reduce make-chain values fns))

(alias ∘ compose)
;; &lt;/compose&gt;
</pre>
</div>

<p>
For unifying oscillators we are going to define signal which will care about
converting time to proper phase. When you deal with periodic signals it's
important to distinguish time from phase, because at different frequencies
phase would be different at the given point of time. Which is okay when
frequency of you oscillator is constant. When it's variable as in FM
synthesis, you need to track phase for your oscillator to make it behave
properly. Let's create special signal <code>phasor</code> for that purpose. It will take
<code>frequency</code> signal and <code>phase0</code> signal and return signal of phase in <code>[0, 1)</code>
half-interval.
</p>

<p>
Here we have an opportunity for a small syntactic improvement. The use-case
when signal is applied to parameters named exactly <code>time</code> and <code>channel</code> in
current scope is very common. Let's create a special syntax for it.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="deref-signal">(define-syntax (&lt;~ stx)
  (syntax-case stx ()
    [(k signal)
     (with-syntax ([time (datum-&gt;syntax #'k 'time)]
		   [channel (datum-&gt;syntax #'k 'channel)])
       #'(signal time channel))]))
</pre>
</div>

<p>
Let's use it in our phasor signal. Phasor is used so frequently that we want
to provide a small optimization for the case when frequency is known to be
constant.
</p>

<p>
Note that <code>dynamic-phasor</code> relies on being called sample by sample. Skipping
samples is okay-ish (it's like pausing phasor), but calling the same phasor
from several other signals could make it move too fast. We need additional
check to protect it.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="phasor">;; &lt;phasor&gt;
(define (dynamic-phasor frequency phase0)
  (let ([previous-times (make-vector *channels* 0.0)]
	[previous-phases (make-vector *channels* 0.0)])
    (~&lt;
     (let* ([previous-time (vector-ref previous-times channel)]
	    [phase-delta (if (&lt; previous-time time)
			     (/ (&lt;~ frequency) *sample-rate*)
			     0.0)]
	    [next-phase (-&gt; (vector-ref previous-phases channel)
			    (+ phase-delta)
			    (mod 1.0))])
       (vector-set! previous-times channel time)
       (vector-set! previous-phases channel next-phase)
       (-&gt; (&lt;~ phase0)
	   (+ next-phase)
	   (mod 1.0))))))

(define~ (static-phasor frequency phase0)
  (-&gt; time (* frequency) (+ phase0) (mod 1.0)))

(define phasor
  (case-lambda
    [(frequency phase0)
     (if (number? frequency)
	 (static-phasor frequency phase0)
	 (dynamic-phasor frequency phase0))]
    [(frequency)
     (if (number? frequency)
	 (static-phasor frequency 0.0)
	 (dynamic-phasor frequency ∅))]))

(alias /// phasor)
;; &lt;/phasor&gt;
</pre>
</div>

<p>
Then basic waveforms are defined in very clean way:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="waveforms">;; &lt;waveforms&gt;
(define~ (sine phase)
  (sin (* 2π (&lt;~ phase))))

(define~ (cosine phase)
  (cos (* 2π (&lt;~ phase))))

(define~ (square phase)
  (if (&lt; (&lt;~ phase) 0.5)
      1.0
      -1.0))

;; when `pulse-width' is `(constant 0.5)' it's identical to `square-wave'
(define~ (pulse pulse-width phase)
  (if (&lt; (&lt;~ phase) (&lt;~ pulse-width))
      1.0
      -1.0))

(define~ (tri phase)
  (let ([phase (&lt;~ phase)])
    (if (&lt; phase 0.5)
	(- (* 4.0 phase) 1.0)
	(+ (* -4.0 phase) 3.0))))

(define~ (saw phase)
  (- (* 2.0 (&lt;~ phase)) 1.0))

(define (sampler table phase)
  (let ([n (fixnum-&gt;flonum (vector-length table))])
    (~&lt; (vector-ref table (flonum-&gt;fixnum (fltruncate (fl* (&lt;~ phase) n)))))))

(define sine/// (∘ sine phasor))
(define cosine/// (∘ cosine phasor))
(define square/// (∘ square phasor))
(define pulse///
  (case-lambda
    [(pulse-width frequency phase0)
     (pulse pulse-width (phasor frequency phase0))]
    [(pulse-width frequency)
     (pulse pulse-width (phasor frequency ∅))]))
(define tri/// (∘ tri phasor))
(define saw/// (∘ saw phasor))
(define sampler///
  (case-lambda
    [(table frequency) (sampler table (phasor frequency))]
    [(table frequency phase0) (sampler table (phasor frequency phase0))]))
;; &lt;/waveforms&gt;
</pre>
</div>

<p>
Before we play something interesting with stuff we already defined we need
one more helper. Drawback of our way of composition of signals is that we
can't change code of one of them in live and make changed reloaded live, even
if signal is not anonymous and was defined as a top-level variable. For
signal which we plan to reload dynamically we are going to introduce wrapper
which will look for given signal's symbol on every invocation:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="live-signal">;; &lt;live-signal&gt;
(define~ (live-signal symbol) (&lt;~ (top-level-value symbol)))
;; &lt;/live-signal&gt;
</pre>
</div>

<p>
Also useful to have live value counterpart:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="live-value">;; &lt;live-value&gt;
(define~ (live-value symbol) (top-level-value symbol))
;; &lt;/live-value&gt;
</pre>
</div>

<p>
Next step is implementation of signal arithmetics to ease their mixing and
matching.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="signal-operators">;; &lt;signal-operators&gt;
(define~ (signal-sum* x y)
  (+ (&lt;~ x) (&lt;~ y)))

(define (signal-sum x . xs)
  (fold-left signal-sum* x xs))

(define~ (signal-prod* x y)
  (* (&lt;~ x) (&lt;~ y)))

(define (signal-prod x . xs)
  (fold-left signal-prod* x xs))

(define (signal-diff x . xs)
  (let ([y (apply signal-sum xs)])
    (~&lt; (- (&lt;~ x) (&lt;~ y)))))

(define (signal-div x . xs)
  (let ([y (apply signal-prod xs)])
    (~&lt; (/ (&lt;~ x) (&lt;~ y)))))

(alias +~ signal-sum)
(alias *~ signal-prod)
(alias -~ signal-diff)
(alias /~ signal-div)

(define ∑ (cut apply signal-sum &lt;...&gt;))

(define ∏ (cut apply signal-prod &lt;...&gt;))

;; normalizing +~
(define (mix . args)
  (*~ (∑ args) (constant (inexact (/ (sqrt (length args)))))))

(define~ (pan p)
  (let ([p (* 0.5 (+ 1.0 (&lt;~ p)))])
    (if (zero? channel)
	(- 1.0 p)
	p)))
;; &lt;/signal-operators&gt;
</pre>
</div>
</div>
</div>
