README.org
** Envelopes

*** ADSR

   ADSR envelope shapes signal with polyline described with 4 parameters:

   - Attack time is the time taken for initial run-up of level from nil to peak,
     beginning when the key is first pressed.
   - Decay time is the time taken for the subsequent run down from the attack
     level to the designated sustain level.
   - Sustain level is the level during the main sequence of the sound's
     duration, until the key is released.
   - Release time is the time taken for the level to decay from the sustain
     level to zero after the key is released.

   (Thanks, [[https://en.wikipedia.org/wiki/Synthesizer#Attack_Decay_Sustain_Release_.28ADSR.29_envelope][Wikipedia]])

   Two more parameter required to apply envelope in real performance: note's
   moments of start and end. To make envelope generic and open for crazy
   experiments all 6 parameters are going to be signals:

#+NAME: adsr
#+BEGIN_SRC scheme
  ;; <adsr>
  (define~ (adsr start end attack decay sustain release)
    (let ([end (<~ end)])
      (if (<= end time)
          ;; NOTE OFF
          (let ([Δt (- time end)]
                [r (<~ release)])
            (if (and (positive? r)
                     (<= Δt r))
                (* (- 1.0 (/ Δt r)) (<~ sustain))
                0.0))
          ;; NOTE ON
          (let ([start (<~ start)])
            (if (<= start time)
                (let ([Δt (- time start)]
                      [a (<~ attack)])
                  (if (and (positive? a)
                           (<= Δt a))
                      (/ Δt a)
                      (let ([Δt (- Δt a)]
                            [d (<~ decay)]
                            [s (<~ sustain)])
                        (if (and (positive? d)
                                 (<= Δt d))
                            (- 1.0 (* (- 1.0 s) (/ Δt d)))
                            s))))
                0.0)))))
  ;; </adsr>
#+END_SRC

   Let's test it with simple note play:

#+NAME: play-note
#+BEGIN_SRC scheme
  ;; <play-note>
  (define (simple-instrument start end freq a d s r)
    (let* ([start (live-value start)]
           [end (live-value end)]
           [freq (live-value freq)]
           [osc (sine-wave (phasor freq))]
           [env (adsr start end (~< a) (~< d) (~< s) (~< r))])
      (*~ env osc)))

  (define (make-play-note start end frequency)
    (λ (freq dur)
      (set-top-level-value! frequency freq)
      (set-top-level-value! start (now))
      (set-top-level-value! end (+ (now) dur))))

  ;; (define start 0.0)
  ;; (define end 1.0)
  ;; (define frequency 440.0)

  ;; (define inst (simple-intrument 'start 'end 'frequency 0.3 0.5 0.8 1.0))
  ;; (define play-note (make-play-note 'start 'end 'frequency))

  ;; (sound:set-dsp! (live-signal 'inst))
  ;; (play-note 440.0 1.1)
  ;; </play-note>
#+END_SRC

   We return to instrument concept later and come up with better design for it.

*** Impulse

    Another simple though useful envelope is impulse.

#+NAME: impulse
#+BEGIN_SRC scheme
  ;; <impulse>
  (define~ (impulse start apex)
    (let ([start (<~ start)])
      (if (<= start time)
          (let ([h (/ (- time start)
                      (- (<~ apex) start))])
            (* h (exp (- 1.0 h))))
          0.0)))
  ;; </impulse>
#+END_SRC

*** Transition

#+NAME: transition
#+BEGIN_SRC scheme
  ;; <transition>
  (define (transition curve Δt signal)
    (let ([starts (make-vector *channels* (now))]
          [previous-values (make-vector *channels* 0.0)]
          [next-values (make-vector *channels* 0.0)])
      (~<
       (let ([Δt (<~ Δt)]
             [current-value (<~ signal)]
             [next-value (vector-ref next-values channel)])
         (unless (= current-value next-value)
           (vector-set! previous-values channel next-value)
           (vector-set! next-values channel current-value)
           (vector-set! starts channel time))
         (let ([δt (- time (vector-ref starts channel))])
           (if (< δt Δt)
               (let ([previous-value (vector-ref previous-values channel)])
                 (+ previous-value
                    (curve (/ δt Δt) (- current-value previous-value))))
               current-value))))))

  (define (instant-curve a Δx)
    Δx)

  (define (linear-curve a Δx)
    (* a Δx))

  (define (quadratic-curve a Δx)
    (* (expt a 4.0) Δx))

  (define instant-transition (cut transition instant-curve unit <>))
  (define linear-transition (cut transition linear-curve <> <>))
  (define quadratic-transition (cut transition quadratic-curve <> <>))
  ;; </transition>
#+END_SRC

** Metronome

  Metronome is a mean to align scheduling with some periodic beat.

** Control signals

#+NAME: control-signal
#+BEGIN_SRC scheme
  ;; <control-signal>
  (define make-control
    (case-lambda
      [(x)
       (if (number? x)
           (make-control id x)
           (make-control x 0.0))]
      [(f x)
       (values (~< x) (λ args (set! x (apply f args))))]))
  ;; </control-signal>
#+END_SRC

#+NAME: beat
#+BEGIN_SRC scheme
  ;; <beat>
  (define (time->beat time bpm)
    (-> time (* bpm) (/ 60) (round)))

  (define (beat->time beat bpm)
    (-> beat (* 60) (/ bpm)))

  (define (next-beat time bpm)
    (beat->time (+ 1 (time->beat time bpm)) bpm))

  (define (metro bpm . args)
    (apply schedule (next-beat (now) bpm) args))

  (define *bpm* 60.0)

  (define (set-bpm! bpm)
    (set! *bpm* bpm))

  (define (*beat*)
    (time->beat (now) *bpm*))

  (define (*metro* . args)
    (apply metro *bpm* args))
  ;; </beat>
#+END_SRC

* Std

** FFT
