README.html

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Envelopes</h3>
<div class="outline-text-3" id="text-5-3">
</div><div id="outline-container-sec-5-3-1" class="outline-4">
<h4 id="sec-5-3-1"><span class="section-number-4">5.3.1</span> ADSR</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
ADSR envelope shapes signal with polyline described with 4 parameters:
</p>

<ul class="org-ul">
<li>Attack time is the time taken for initial run-up of level from nil to peak,
beginning when the key is first pressed.
</li>
<li>Decay time is the time taken for the subsequent run down from the attack
level to the designated sustain level.
</li>
<li>Sustain level is the level during the main sequence of the sound's
duration, until the key is released.
</li>
<li>Release time is the time taken for the level to decay from the sustain
level to zero after the key is released.
</li>
</ul>

<p>
(Thanks, <a href="https://en.wikipedia.org/wiki/Synthesizer#Attack_Decay_Sustain_Release_.28ADSR.29_envelope">Wikipedia</a>)
</p>

<p>
Two more parameter required to apply envelope in real performance: note's
moments of start and end. To make envelope generic and open for crazy
experiments all 6 parameters are going to be signals:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="adsr">;; &lt;adsr&gt;
(define~ (adsr start end attack decay sustain release)
  (let ([end (&lt;~ end)])
    (if (&lt;= end time)
	;; NOTE OFF
	(let ([Δt (- time end)]
	      [r (&lt;~ release)])
	  (if (and (positive? r)
		   (&lt;= Δt r))
	      (* (- 1.0 (/ Δt r)) (&lt;~ sustain))
	      0.0))
	;; NOTE ON
	(let ([start (&lt;~ start)])
	  (if (&lt;= start time)
	      (let ([Δt (- time start)]
		    [a (&lt;~ attack)])
		(if (and (positive? a)
			 (&lt;= Δt a))
		    (/ Δt a)
		    (let ([Δt (- Δt a)]
			  [d (&lt;~ decay)]
			  [s (&lt;~ sustain)])
		      (if (and (positive? d)
			       (&lt;= Δt d))
			  (- 1.0 (* (- 1.0 s) (/ Δt d)))
			  s))))
	      0.0)))))
;; &lt;/adsr&gt;
</pre>
</div>

<p>
Let's test it with simple note play:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="play-note">;; &lt;play-note&gt;
(define (simple-instrument start end freq a d s r)
  (let* ([start (live-value start)]
	 [end (live-value end)]
	 [freq (live-value freq)]
	 [osc (sine-wave (phasor freq))]
	 [env (adsr start end (~&lt; a) (~&lt; d) (~&lt; s) (~&lt; r))])
    (*~ env osc)))

(define (make-play-note start end frequency)
  (λ (freq dur)
    (set-top-level-value! frequency freq)
    (set-top-level-value! start (now))
    (set-top-level-value! end (+ (now) dur))))

;; (define start 0.0)
;; (define end 1.0)
;; (define frequency 440.0)

;; (define inst (simple-intrument 'start 'end 'frequency 0.3 0.5 0.8 1.0))
;; (define play-note (make-play-note 'start 'end 'frequency))

;; (sound:set-dsp! (live-signal 'inst))
;; (play-note 440.0 1.1)
;; &lt;/play-note&gt;
</pre>
</div>

<p>
We return to instrument concept later and come up with better design for it.
</p>
</div>
</div>

<div id="outline-container-sec-5-3-2" class="outline-4">
<h4 id="sec-5-3-2"><span class="section-number-4">5.3.2</span> Impulse</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
Another simple though useful envelope is impulse.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="impulse">;; &lt;impulse&gt;
(define~ (impulse start apex)
  (let ([start (&lt;~ start)])
    (if (&lt;= start time)
	(let ([h (/ (- time start)
		    (- (&lt;~ apex) start))])
	  (* h (exp (- 1.0 h))))
	0.0)))
;; &lt;/impulse&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-3-3" class="outline-4">
<h4 id="sec-5-3-3"><span class="section-number-4">5.3.3</span> Transition</h4>
<div class="outline-text-4" id="text-5-3-3">
<div class="org-src-container">

<pre class="src src-scheme" id="transition">;; &lt;transition&gt;
(define (transition curve Δt signal)
  (let ([starts (make-vector *channels* (now))]
	[previous-values (make-vector *channels* 0.0)]
	[next-values (make-vector *channels* 0.0)])
    (~&lt;
     (let ([Δt (&lt;~ Δt)]
	   [current-value (&lt;~ signal)]
	   [next-value (vector-ref next-values channel)])
       (unless (= current-value next-value)
	 (vector-set! previous-values channel next-value)
	 (vector-set! next-values channel current-value)
	 (vector-set! starts channel time))
       (let ([δt (- time (vector-ref starts channel))])
	 (if (&lt; δt Δt)
	     (let ([previous-value (vector-ref previous-values channel)])
	       (+ previous-value
		  (curve (/ δt Δt) (- current-value previous-value))))
	     current-value))))))

(define (instant-curve a Δx)
  Δx)

(define (linear-curve a Δx)
  (* a Δx))

(define (quadratic-curve a Δx)
  (* (expt a 4.0) Δx))

(define instant-transition (cut transition instant-curve unit &lt;&gt;))
(define linear-transition (cut transition linear-curve &lt;&gt; &lt;&gt;))
(define quadratic-transition (cut transition quadratic-curve &lt;&gt; &lt;&gt;))
;; &lt;/transition&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Metronome</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Metronome is a mean to align scheduling with some periodic beat.
</p>
</div>
</div>

<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> Control signals</h3>
<div class="outline-text-3" id="text-5-5">
<div class="org-src-container">

<pre class="src src-scheme" id="control-signal">;; &lt;control-signal&gt;
(define make-control
  (case-lambda
    [(x)
     (if (number? x)
	 (make-control id x)
	 (make-control x 0.0))]
    [(f x)
     (values (~&lt; x) (λ args (set! x (apply f args))))]))
;; &lt;/control-signal&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="beat">;; &lt;beat&gt;
(define (time-&gt;beat time bpm)
  (-&gt; time (* bpm) (/ 60) (round)))

(define (beat-&gt;time beat bpm)
  (-&gt; beat (* 60) (/ bpm)))

(define (next-beat time bpm)
  (beat-&gt;time (+ 1 (time-&gt;beat time bpm)) bpm))

(define (metro bpm . args)
  (apply schedule (next-beat (now) bpm) args))

(define *bpm* 60.0)

(define (set-bpm! bpm)
  (set! *bpm* bpm))

(define (*beat*)
  (time-&gt;beat (now) *bpm*))

(define (*metro* . args)
  (apply metro *bpm* args))
;; &lt;/beat&gt;
</pre>
</div>
</div>
</div>
</div>
