README.org
** Filters

#+NAME: delay
#+BEGIN_SRC scheme
  ;; <delay>
  (define~ (delay Δt f)
    (f (- time (<~ Δt)) channel))
  ;; </delay>
#+END_SRC

#+NAME: echo
#+BEGIN_SRC scheme
  ;; <echo>
  (define *max-line-duration* 1)

  (define (echo delay feedback signal)
    (let ([line-size (* *max-line-duration* *sample-rate*)]
          [lines (make-vector *channels*)]
          [cursor -1])
      (do ([i 0 (+ i 1)])
          ((= i *channels*) 0)
        (vector-set! lines i (make-vector line-size 0.0)))
      (~<
       (when(zero? channel)
         (set! cursor (mod (+ cursor 1) line-size)))
       (let ([line (vector-ref lines channel)]
             [x (<~ signal)]
             [delay (flonum->fixnum (round (* (<~ delay) *sample-rate*)))]
             [feedback (<~ feedback)])
         (let* ([i (mod (+ line-size (- cursor delay)) line-size)]
                [y (vector-ref line i)]
                [z (+ x (* feedback y))])
           (vector-set! line cursor z)
           z)))))
  ;; </echo>
#+END_SRC

#+NAME: lpf
#+BEGIN_SRC scheme
  ;; <lpf>
  (define (lpf-frequency->α frequency)
    (let ([k (* frequency *sample-angular-period*)])
      (/ k (+ k 1))))

  (define (lpf frequency x)
    (let ([ys (make-vector *channels* 0.0)])
      (~<
       (let* ([y-1 (vector-ref ys channel)]
              [α (lpf-frequency->α (<~ frequency))])
         (let ([y (+ y-1 (* α (- (<~ x) y-1)))])
           (vector-set! ys channel y)
           y)))))
  ;; </lpf>
#+END_SRC

#+NAME: hpf
#+BEGIN_SRC scheme
  ;; <hpf>
  (define (hpf-frequency->α frequency)
    (let ([k (* frequency *sample-angular-period*)])
      (/ (+ k 1))))

  (define (hpf frequency x)
    (let ([xs (make-vector *channels* 0.0)]
          [ys (make-vector *channels* 0.0)])
      (~<
       (let ([x-1 (vector-ref xs channel)]
             [y-1 (vector-ref ys channel)]
             [x (<~ x)]
             [α (hpf-frequency->α (<~ frequency))])
         (let ([y (* α (+ y-1 (- x x-1)))])
           (vector-set! xs channel x)
           (vector-set! ys channel y)
           y)))))
  ;; </hpf>
#+END_SRC

#+NAME: make-biquad-filter
#+BEGIN_SRC scheme
  ;; <make-biquad-filter>
  (define (make-biquad-filter make-coefficients)
    (λ (Q frequency x)
      (let ([xs-1 (make-vector *channels* 0.0)]
            [xs-2 (make-vector *channels* 0.0)]
            [ys-1 (make-vector *channels* 0.0)]
            [ys-2 (make-vector *channels* 0.0)])
        (~<
         (let ([x-1 (vector-ref xs-1 channel)]
               [x-2 (vector-ref xs-2 channel)]
               [y-1 (vector-ref ys-1 channel)]
               [y-2 (vector-ref ys-2 channel)]
               [x (<~ x)]
               [Q (<~ Q)]
               [frequency (<~ frequency)])
           (let* ([ω (* frequency *sample-angular-period*)]
                  [sin-ω (sin ω)]
                  [cos-ω (cos ω)]
                  [α (/ sin-ω (* 2.0 Q))])
             (let-values ([(b0 b1 b2 a0 a1 a2) (make-coefficients sin-ω cos-ω α)])
               (let ([y (-
                         (+
                          (* (/ b0 a0) x)
                          (* (/ b1 a0) x-1)
                          (* (/ b2 a0) x-2))
                         (* (/ a1 a0) y-1)
                         (* (/ a2 a0) y-2))])
                 (vector-set! xs-1 channel x)
                 (vector-set! xs-2 channel x-1)
                 (vector-set! ys-1 channel y)
                 (vector-set! ys-2 channel y-1)
                 y))))))))
  ;; </make-biquad-filter>
#+END_SRC

#+NAME: biquad-lpf
#+BEGIN_SRC scheme
  ;; <biquad-lpf>
  (define (make-lpf-coefficients sin-ω cos-ω α)
    (let ([b0 (* 0.5 (- 1.0 cos-ω))])
      (values
       b0             ;; b0
       (- 1.0 cos-ω)  ;; b1
       b0             ;; b2
       (+ 1.0 α)      ;; a0
       (* -2.0 cos-ω) ;; a1
       (- 1.0 α)      ;; a2
       )))

  (define biquad-lpf (make-biquad-filter make-lpf-coefficients))
  ;; </biquad-lpf>
#+END_SRC

#+NAME: biquad-hpf
#+BEGIN_SRC scheme
  ;; <biquad-hpf>
  (define (make-hpf-coefficients sin-ω cos-ω α)
    (let ([b0 (* 0.5 (+ 1.0 cos-ω))])
      (values
       b0             ;; b0
       (- -1.0 cos-ω) ;; b1
       b0             ;; b2
       (+ 1.0 α)      ;; a0
       (* -2.0 cos-ω) ;; a1
       (- 1.0 α)      ;; a2
       )))

  (define biquad-hpf (make-biquad-filter make-hpf-coefficients))
  ;; </biquad-hpf>
#+END_SRC

** Instruments

#+NAME: polyphony
#+BEGIN_SRC scheme
  ;; <polyphony>
  (define (make-polyphony n make-voice)
    (let ([voices (make-vector n ∅)]
          [cursor 0])
      (let ([signal
             (apply mix (list-ec (: i n) (~< (<~ (vector-ref voices i)))))]
            [play-note
             (λ args
               (let ([voice (apply make-voice args)])
                 (vector-set! voices cursor voice)
                 (set! cursor (mod (+ cursor 1) n))
                 voice))])
        (values signal play-note))))

  (define (make-static-polyphony n make-voice)
    ;; (make-voice) -> (list signal play-note)
    (let ([voices (list-ec (: i n) (make-voice))]
          [cursor 0])
      (let ([signal (apply mix (map first voices))]
            [play-note
             (λ args
               (apply (second (vector-ref voices cursor)) args)
               (set! cursor (mod (+ cursor 1) n)))])
        (values signal play-note))))
  ;; </polyphony>
#+END_SRC


** Scales

   We are going to represent scales with Scheme's basic data structure, list.
   And the most basic operation which we want to perform on scale is chosing a
   note from it without worrying about falling out of range:

#+NAME: choice
#+BEGIN_SRC scheme
  ;; <choice>
  (define (choice list n)
    (list-ref list (mod n (length list))))

  (define (random-choice list)
    (list-ref list (random (length list))))
  ;; </choice>
#+END_SRC

  Basic intervals from Western music.

#+NAME: intervals
#+BEGIN_SRC scheme
  ;; <intervals>
  (define chromatic-scale-half-step
    (expt 2 1/12))

  (define second-interval (expt chromatic-scale-half-step 2))
  (define third-interval (expt chromatic-scale-half-step 4))
  (define perfect-fourth-interval (expt chromatic-scale-half-step 5))
  (define perfect-fifth-interval (expt chromatic-scale-half-step 7))
  (define major-sixth-interval (expt chromatic-scale-half-step 9))
  (define major-seventh-interval (expt chromatic-scale-half-step 11))
  (define perfect-octave-interval (expt chromatic-scale-half-step 12))
  (define minor-second-interval (expt chromatic-scale-half-step 1))
  (define minor-third-interval (expt chromatic-scale-half-step 3))
  (define minor-sixth-interval (expt chromatic-scale-half-step 8))
  (define minor-seventh-interval (expt chromatic-scale-half-step 11))
  (define triton-interval (expt chromatic-scale-half-step 11))
  ;; </intervals>
#+END_SRC

  Some basic scales from Western music.

#+NAME: scales
#+BEGIN_SRC scheme
  ;; <scales>
  (define chromatic-scale '(1 2 3 4 5 6 7 8 9 10 11 12))
  (define pentatonic-scale '(1 3 5 8 10))
  (define major-scale '(1 3 5 6 8 10 12))
  (define minor-scale '(1 3 4 6 8 9 11))

  (define (make-scale base-frequency scale)
    (map (λ (x) (* base-frequency (expt chromatic-scale-half-step (- x 1)))) scale))
  ;; </scales>
#+END_SRC

** Rhythm

#+NAME: pattern
#+BEGIN_SRC scheme
  ;; <pattern>
  (define (play-pattern pattern sound beat)
    (let ([n (length pattern)])
      (when (positive? (choice pattern (exact beat)))
        (sound))))
  ;; </pattern>
#+END_SRC

