README.html

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Std</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> FFT</h3>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Filters</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">

<pre class="src src-scheme" id="delay">;; &lt;delay&gt;
(define~ (delay Δt f)
  (f (- time (&lt;~ Δt)) channel))
;; &lt;/delay&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="echo">;; &lt;echo&gt;
(define *max-line-duration* 1)

(define (echo delay feedback signal)
  (let ([line-size (* *max-line-duration* *sample-rate*)]
	[lines (make-vector *channels*)]
	[cursor -1])
    (do ([i 0 (+ i 1)])
	((= i *channels*) 0)
      (vector-set! lines i (make-vector line-size 0.0)))
    (~&lt;
     (when(zero? channel)
       (set! cursor (mod (+ cursor 1) line-size)))
     (let ([line (vector-ref lines channel)]
	   [x (&lt;~ signal)]
	   [delay (flonum-&gt;fixnum (round (* (&lt;~ delay) *sample-rate*)))]
	   [feedback (&lt;~ feedback)])
       (let* ([i (mod (+ line-size (- cursor delay)) line-size)]
	      [y (vector-ref line i)]
	      [z (+ x (* feedback y))])
	 (vector-set! line cursor z)
	 z)))))
;; &lt;/echo&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="lpf">;; &lt;lpf&gt;
(define (lpf-frequency-&gt;α frequency)
  (let ([k (* frequency *sample-angular-period*)])
    (/ k (+ k 1))))

(define (lpf frequency x)
  (let ([ys (make-vector *channels* 0.0)])
    (~&lt;
     (let* ([y-1 (vector-ref ys channel)]
	    [α (lpf-frequency-&gt;α (&lt;~ frequency))])
       (let ([y (+ y-1 (* α (- (&lt;~ x) y-1)))])
	 (vector-set! ys channel y)
	 y)))))
;; &lt;/lpf&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="hpf">;; &lt;hpf&gt;
(define (hpf-frequency-&gt;α frequency)
  (let ([k (* frequency *sample-angular-period*)])
    (/ (+ k 1))))

(define (hpf frequency x)
  (let ([xs (make-vector *channels* 0.0)]
	[ys (make-vector *channels* 0.0)])
    (~&lt;
     (let ([x-1 (vector-ref xs channel)]
	   [y-1 (vector-ref ys channel)]
	   [x (&lt;~ x)]
	   [α (hpf-frequency-&gt;α (&lt;~ frequency))])
       (let ([y (* α (+ y-1 (- x x-1)))])
	 (vector-set! xs channel x)
	 (vector-set! ys channel y)
	 y)))))
;; &lt;/hpf&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="make-biquad-filter">;; &lt;make-biquad-filter&gt;
(define (make-biquad-filter make-coefficients)
  (λ (Q frequency x)
    (let ([xs-1 (make-vector *channels* 0.0)]
	  [xs-2 (make-vector *channels* 0.0)]
	  [ys-1 (make-vector *channels* 0.0)]
	  [ys-2 (make-vector *channels* 0.0)])
      (~&lt;
       (let ([x-1 (vector-ref xs-1 channel)]
	     [x-2 (vector-ref xs-2 channel)]
	     [y-1 (vector-ref ys-1 channel)]
	     [y-2 (vector-ref ys-2 channel)]
	     [x (&lt;~ x)]
	     [Q (&lt;~ Q)]
	     [frequency (&lt;~ frequency)])
	 (let* ([ω (* frequency *sample-angular-period*)]
		[sin-ω (sin ω)]
		[cos-ω (cos ω)]
		[α (/ sin-ω (* 2.0 Q))])
	   (let-values ([(b0 b1 b2 a0 a1 a2) (make-coefficients sin-ω cos-ω α)])
	     (let ([y (-
		       (+
			(* (/ b0 a0) x)
			(* (/ b1 a0) x-1)
			(* (/ b2 a0) x-2))
		       (* (/ a1 a0) y-1)
		       (* (/ a2 a0) y-2))])
	       (vector-set! xs-1 channel x)
	       (vector-set! xs-2 channel x-1)
	       (vector-set! ys-1 channel y)
	       (vector-set! ys-2 channel y-1)
	       y))))))))
;; &lt;/make-biquad-filter&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="biquad-lpf">;; &lt;biquad-lpf&gt;
(define (make-lpf-coefficients sin-ω cos-ω α)
  (let ([b0 (* 0.5 (- 1.0 cos-ω))])
    (values
     b0             ;; b0
     (- 1.0 cos-ω)  ;; b1
     b0             ;; b2
     (+ 1.0 α)      ;; a0
     (* -2.0 cos-ω) ;; a1
     (- 1.0 α)      ;; a2
     )))

(define biquad-lpf (make-biquad-filter make-lpf-coefficients))
;; &lt;/biquad-lpf&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="biquad-hpf">;; &lt;biquad-hpf&gt;
(define (make-hpf-coefficients sin-ω cos-ω α)
  (let ([b0 (* 0.5 (+ 1.0 cos-ω))])
    (values
     b0             ;; b0
     (- -1.0 cos-ω) ;; b1
     b0             ;; b2
     (+ 1.0 α)      ;; a0
     (* -2.0 cos-ω) ;; a1
     (- 1.0 α)      ;; a2
     )))

(define biquad-hpf (make-biquad-filter make-hpf-coefficients))
;; &lt;/biquad-hpf&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Instruments</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">

<pre class="src src-scheme" id="polyphony">;; &lt;polyphony&gt;
(define (make-polyphony n make-voice)
  (let ([voices (make-vector n ∅)]
	[cursor 0])
    (let ([signal
	   (apply mix (list-ec (: i n) (~&lt; (&lt;~ (vector-ref voices i)))))]
	  [play-note
	   (λ args
	     (let ([voice (apply make-voice args)])
	       (vector-set! voices cursor voice)
	       (set! cursor (mod (+ cursor 1) n))
	       voice))])
      (values signal play-note))))

(define (make-static-polyphony n make-voice)
  ;; (make-voice) -&gt; (list signal play-note)
  (let ([voices (list-ec (: i n) (make-voice))]
	[cursor 0])
    (let ([signal (apply mix (map first voices))]
	  [play-note
	   (λ args
	     (apply (second (vector-ref voices cursor)) args)
	     (set! cursor (mod (+ cursor 1) n)))])
      (values signal play-note))))
;; &lt;/polyphony&gt;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Scales</h3>
<div class="outline-text-3" id="text-6-4">
<p>
We are going to represent scales with Scheme's basic data structure, list.
And the most basic operation which we want to perform on scale is chosing a
note from it without worrying about falling out of range:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="choice">;; &lt;choice&gt;
(define (choice list n)
  (list-ref list (mod n (length list))))

(define (random-choice list)
  (list-ref list (random (length list))))
;; &lt;/choice&gt;
</pre>
</div>

<p>
Basic intervals from Western music.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="intervals">;; &lt;intervals&gt;
(define chromatic-scale-half-step
  (expt 2 1/12))

(define second-interval (expt chromatic-scale-half-step 2))
(define third-interval (expt chromatic-scale-half-step 4))
(define perfect-fourth-interval (expt chromatic-scale-half-step 5))
(define perfect-fifth-interval (expt chromatic-scale-half-step 7))
(define major-sixth-interval (expt chromatic-scale-half-step 9))
(define major-seventh-interval (expt chromatic-scale-half-step 11))
(define perfect-octave-interval (expt chromatic-scale-half-step 12))
(define minor-second-interval (expt chromatic-scale-half-step 1))
(define minor-third-interval (expt chromatic-scale-half-step 3))
(define minor-sixth-interval (expt chromatic-scale-half-step 8))
(define minor-seventh-interval (expt chromatic-scale-half-step 11))
(define triton-interval (expt chromatic-scale-half-step 11))
;; &lt;/intervals&gt;
</pre>
</div>

<p>
Some basic scales from Western music.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="scales">;; &lt;scales&gt;
(define chromatic-scale '(1 2 3 4 5 6 7 8 9 10 11 12))
(define pentatonic-scale '(1 3 5 8 10))
(define major-scale '(1 3 5 6 8 10 12))
(define minor-scale '(1 3 4 6 8 9 11))

(define (make-scale base-frequency scale)
  (map (λ (x) (* base-frequency (expt chromatic-scale-half-step (- x 1)))) scale))
;; &lt;/scales&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> Rhythm</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">

<pre class="src src-scheme" id="pattern">;; &lt;pattern&gt;
(define (play-pattern pattern sound beat)
  (let ([n (length pattern)])
    (when (positive? (choice pattern (exact beat)))
      (sound))))
;; &lt;/pattern&gt;
</pre>
</div>
</div>
</div>
