README.org
** MIDI

#+NAME: midi
#+BEGIN_SRC scheme
  ;; <midi>
  (define (*on-note-on* timestamp data1 data2 channel)
    (printf "~s:~s:~s:~s\r\n" timestamp data1 data2 channel))

  (define (*on-note-off* timestamp data1 data2 channel)
    (printf "~s:~s:~s:~s\r\n" timestamp data1 data2 channel))

  (define (*on-cc* timestamp data1 data2 channel)
    (printf "~s:~s:~s:~s\r\n" timestamp data1 data2 channel))

  (define (set-note-on! f) (set! *on-note-on* f))
  (define (set-note-off! f) (set! *on-note-off* f))
  (define (set-cc! f) (set! *on-cc* f))

  (define *polling-cycle* 0.005)

  (define *stream* #f)
  (define *scheduler* #f)

  (define (process-event timestamp type data1 data2 channel)
    (cond
      [(= type pm:*midi-note-on*) (*on-note-on* timestamp data1 data2 channel)]
      [(= type pm:*midi-note-off*) (*on-note-off* timestamp data1 data2 channel)]
      [(= type pm:*midi-cc*) (*on-cc* timestamp data1 data2 channel)]
      [else (printf "Unsupported event type: ~s\r\n" type)]))

  (define (make-safe-process-event timestamp)
    (lambda args
      (guard (_ [else #f]) (apply process-event timestamp args))))

  (define (process-events)
    (let ([timestamp (scheduler:now *scheduler*)])
      (when (pm:poll *stream*)
        (pm:read *stream* (make-safe-process-event timestamp)))
      (scheduler:schedule *scheduler*
                          (+ timestamp *polling-cycle*)
                          process-events)))

  (define (start now)
    (unless *stream*
      (pm:init)
      (set! *stream* (pm:open-input 0))
      (set! *scheduler* (scheduler:simple-scheduler now))
      (scheduler:start-scheduler *scheduler*)
      (process-events)))

  (define (stop)
    (when *stream*
      (scheduler:stop-scheduler *scheduler*)
      (pm:close *stream*)
      (pm:terminate)
      (set! *stream* #f)
      (set! *scheduler* #f)))
  ;; </midi>
#+END_SRC
* Misc

  To import =chez-soundio= and =chez-sockets= we must add respective folders to
  =library-directories= To do that let's create a couple of helpers:

#+NAME: add-library-directories
#+BEGIN_SRC scheme
  ;; <add-library-directories>
  (define (add-library-directory dir)
    (library-directories
     (cons dir (library-directories))))

  (define (add-library-directories . dirs)
    (unless (null? dirs)
      (add-library-directory (car dirs))
      (apply add-library-directories (cdr dirs))))

  (add-library-directories
   "./chez-soundio"
   "./chez-portmidi"
   "./chez-sockets")
  ;; </add-library-directories>
#+END_SRC

  Also let's define several useful aliases and finally start our services:

#+NAME: ad-libitum-init
#+BEGIN_SRC scheme
  ;; <ad-libitum-init>
  (alias now sound:now)
  (alias schedule scheduler:*schedule*)
  (alias callback schedule)

  ;; in case of emergency ☺
  (alias h! sound:hush!)

  (alias play! sound:set-dsp!)

  (sound:start)
  (scheduler:init now)
  (scheduler:start)
  (repl:start-repl-server)
  ;; </ad-libitum-init>
#+END_SRC

  Tuner stuff to test everything is working:

#+NAME: test-tuner
#+BEGIN_SRC scheme
  ;; <test-tuner>
  (define (tuner time channel)
    (sin (* 2π time tuner-frequency)))

  ;; (sound:set-dsp! tuner)
  ;; </test-tuner>
#+END_SRC

  Some stuff about time and scales to be moved to appropriate sections when
  we'll come to them:

#+NAME: sandbox
#+BEGIN_SRC scheme
  ;; <sandbox>
  (define (unroll signal period)
    (let* ([n (exact (truncate (* period *sample-rate*)))]
           [table (make-vector n)])
      (do ([i 0 (+ i 1)])
          ((= i n))
        (vector-set! table i (inexact (signal (/ i *sample-rate*) 0))))
      (cut sampler table <>)))

  (define (make-overtone amplitudes wave frequency phase0)
    (∑ (map
        (λ (amplitude factor)
          (let ([factor (inexact factor)])
            (*~ amplitude
                (wave (osc:phasor (*~ (~< factor) frequency) phase0)))))
        amplitudes
        (iota (length amplitudes)))))

  (define (fix-duration duration)
    (let* ([start (now)]
           [end (+ start duration)])
      (values (~< start) (~< end))))

  (define~ (amplitude->phase s)
    (* 0.5 (+ 1.0 (<~ s))))
  ;; </sandbox>
#+END_SRC

