README.html

<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> MIDI</h3>
<div class="outline-text-3" id="text-6-6">
<div class="org-src-container">

<pre class="src src-scheme" id="midi">;; &lt;midi&gt;
(define (*on-note-on* timestamp data1 data2 channel)
  (printf "~s:~s:~s:~s\r\n" timestamp data1 data2 channel))

(define (*on-note-off* timestamp data1 data2 channel)
  (printf "~s:~s:~s:~s\r\n" timestamp data1 data2 channel))

(define (*on-cc* timestamp data1 data2 channel)
  (printf "~s:~s:~s:~s\r\n" timestamp data1 data2 channel))

(define (set-note-on! f) (set! *on-note-on* f))
(define (set-note-off! f) (set! *on-note-off* f))
(define (set-cc! f) (set! *on-cc* f))

(define *polling-cycle* 0.005)

(define *stream* #f)
(define *scheduler* #f)

(define (process-event timestamp type data1 data2 channel)
  (cond
    [(= type pm:*midi-note-on*) (*on-note-on* timestamp data1 data2 channel)]
    [(= type pm:*midi-note-off*) (*on-note-off* timestamp data1 data2 channel)]
    [(= type pm:*midi-cc*) (*on-cc* timestamp data1 data2 channel)]
    [else (printf "Unsupported event type: ~s\r\n" type)]))

(define (make-safe-process-event timestamp)
  (lambda args
    (guard (_ [else #f]) (apply process-event timestamp args))))

(define (process-events)
  (let ([timestamp (scheduler:now *scheduler*)])
    (when (pm:poll *stream*)
      (pm:read *stream* (make-safe-process-event timestamp)))
    (scheduler:schedule *scheduler*
			(+ timestamp *polling-cycle*)
			process-events)))

(define (start now)
  (unless *stream*
    (pm:init)
    (set! *stream* (pm:open-input 0))
    (set! *scheduler* (scheduler:simple-scheduler now))
    (scheduler:start-scheduler *scheduler*)
    (process-events)))

(define (stop)
  (when *stream*
    (scheduler:stop-scheduler *scheduler*)
    (pm:close *stream*)
    (pm:terminate)
    (set! *stream* #f)
    (set! *scheduler* #f)))
;; &lt;/midi&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Misc</h2>
<div class="outline-text-2" id="text-7">
<p>
To import <code>chez-soundio</code> and <code>chez-sockets</code> we must add respective folders to
<code>library-directories</code> To do that let's create a couple of helpers:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="add-library-directories">;; &lt;add-library-directories&gt;
(define (add-library-directory dir)
  (library-directories
   (cons dir (library-directories))))

(define (add-library-directories . dirs)
  (unless (null? dirs)
    (add-library-directory (car dirs))
    (apply add-library-directories (cdr dirs))))

(add-library-directories
 "./chez-soundio"
 "./chez-portmidi"
 "./chez-sockets")
;; &lt;/add-library-directories&gt;
</pre>
</div>

<p>
Also let's define several useful aliases and finally start our services:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="ad-libitum-init">;; &lt;ad-libitum-init&gt;
(alias now sound:now)
(alias schedule scheduler:*schedule*)
(alias callback schedule)

;; in case of emergency ☺
(alias h! sound:hush!)

(alias play! sound:set-dsp!)

(sound:start)
(scheduler:init now)
(scheduler:start)
(repl:start-repl-server)
;; &lt;/ad-libitum-init&gt;
</pre>
</div>

<p>
Tuner stuff to test everything is working:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="test-tuner">;; &lt;test-tuner&gt;
(define (tuner time channel)
  (sin (* 2π time tuner-frequency)))

;; (sound:set-dsp! tuner)
;; &lt;/test-tuner&gt;
</pre>
</div>

<p>
Some stuff about time and scales to be moved to appropriate sections when
we'll come to them:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="sandbox">;; &lt;sandbox&gt;
(define (unroll signal period)
  (let* ([n (exact (truncate (* period *sample-rate*)))]
	 [table (make-vector n)])
    (do ([i 0 (+ i 1)])
	((= i n))
      (vector-set! table i (inexact (signal (/ i *sample-rate*) 0))))
    (cut sampler table &lt;&gt;)))

(define (make-overtone amplitudes wave frequency phase0)
  (∑ (map
      (λ (amplitude factor)
	(let ([factor (inexact factor)])
	  (*~ amplitude
	      (wave (osc:phasor (*~ (~&lt; factor) frequency) phase0)))))
      amplitudes
      (iota (length amplitudes)))))

(define (fix-duration duration)
  (let* ([start (now)]
	 [end (+ start duration)])
    (values (~&lt; start) (~&lt; end))))

(define~ (amplitude-&gt;phase s)
  (* 0.5 (+ 1.0 (&lt;~ s))))
;; &lt;/sandbox&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ruslan Prakapchuk</p>
<p class="date">Created: 2017-10-16 Mon 11:45</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
